### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dev-net-firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-inspect-app-svc"] will be updated in-place
  ~ resource "google_compute_firewall_policy_rule" "hierarchical" {
        id                      = "locations/global/firewallPolicies/896163021144/rules/4201"
      ~ security_profile_group  = "//networksecurity.googleapis.com/organizations/872410903863/locations/global/securityProfileGroups/secprof-nsp-threatprevention-1-group" -> "dev-inspect-sg"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev-single-prjs["app2"].google_folder.app_folder will be created
  + resource "google_folder" "app_folder" {
      + configured_capabilities = (known after apply)
      + create_time             = (known after apply)
      + deletion_protection     = true
      + display_name            = "app2"
      + folder_id               = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + management_project      = (known after apply)
      + name                    = (known after apply)
      + parent                  = "folders/1087303600957"
    }

  # module.dev-single-prjs["app2"].google_folder.env_folders["dev"] will be created
  + resource "google_folder" "env_folders" {
      + configured_capabilities = (known after apply)
      + create_time             = (known after apply)
      + deletion_protection     = true
      + display_name            = "dev"
      + folder_id               = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + management_project      = (known after apply)
      + name                    = (known after apply)
      + parent                  = (known after apply)
    }

  # module.dev-single-prjs["app2"].google_folder.env_folders["prod"] will be created
  + resource "google_folder" "env_folders" {
      + configured_capabilities = (known after apply)
      + create_time             = (known after apply)
      + deletion_protection     = true
      + display_name            = "prod"
      + folder_id               = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + management_project      = (known after apply)
      + name                    = (known after apply)
      + parent                  = (known after apply)
    }

  # module.dev-single-prjs["app2"].google_folder.env_folders["shr"] will be created
  + resource "google_folder" "env_folders" {
      + configured_capabilities = (known after apply)
      + create_time             = (known after apply)
      + deletion_protection     = true
      + display_name            = "shr"
      + folder_id               = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + management_project      = (known after apply)
      + name                    = (known after apply)
      + parent                  = (known after apply)
    }

  # module.dev-single-prjs["app2"].google_network_connectivity_spoke.single-prj-spoke will be created
  + resource "google_network_connectivity_spoke" "single-prj-spoke" {
      + create_time      = (known after apply)
      + description      = "NCC Spoke - Single Prj - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + group            = "projects/chspoc-dev-core/locations/global/hubs/ncc-dev-hub/groups/edge"
      + hub              = "projects/chspoc-dev-core/locations/global/hubs/ncc-dev-hub"
      + id               = (known after apply)
      + location         = "global"
      + name             = "ncc-chspoc-dev-single-app2-spoke"
      + project          = "chspoc-dev-single-app2"
      + reasons          = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + unique_id        = (known after apply)
      + update_time      = (known after apply)

      + linked_vpc_network {
          + uri = (known after apply)
        }
    }

  # module.dev-single-prjs["app2"].google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "019AF3-3082AF-842582"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "chspoc-dev-single-app2"
      + number              = (known after apply)
      + project_id          = "chspoc-dev-single-app2"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.dev-single-prjs["app2"].google_project_iam_member.service_agents["compute-system"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + role    = "roles/compute.serviceAgent"
    }

  # module.dev-single-prjs["app2"].google_project_iam_member.service_agents["container-engine-robot"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + role    = "roles/container.serviceAgent"
    }

  # module.dev-single-prjs["app2"].google_project_iam_member.service_agents["dns"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + role    = "roles/dns.serviceAgent"
    }

  # module.dev-single-prjs["app2"].google_project_iam_member.service_agents["gkenode"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + role    = "roles/container.defaultNodeServiceAgent"
    }

  # module.dev-single-prjs["app2"].google_project_iam_member.service_agents["monitoring-notification"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + role    = "roles/monitoring.notificationServiceAgent"
    }

  # module.dev-single-prjs["app2"].google_project_iam_member.service_agents["networkmanagement"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + role    = "roles/networkmanagement.serviceAgent"
    }

  # module.dev-single-prjs["app2"].google_project_iam_member.service_agents["service-networking"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + role    = "roles/servicenetworking.serviceAgent"
    }

  # module.dev-single-prjs["app2"].google_project_iam_member.service_agents["vpcaccess"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + role    = "roles/vpcaccess.serviceAgent"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "compute.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "container.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["dns.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "dns.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["iap.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "iap.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "logging.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "monitoring.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "networkmanagement.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["networksecurity.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "networksecurity.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service.project_services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-app2"
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service_identity.default["container.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + service = "container.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service_identity.default["dns.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + service = "dns.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service_identity.default["iap.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + service = "iap.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service_identity.default["monitoring.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + service = "monitoring.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service_identity.default["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + service = "networkmanagement.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service_identity.default["networksecurity.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + service = "networksecurity.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service_identity.default["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + service = "servicenetworking.googleapis.com"
    }

  # module.dev-single-prjs["app2"].google_project_service_identity.default["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-app2"
      + service = "vpcaccess.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_folder.app_folder will be created
  + resource "google_folder" "app_folder" {
      + configured_capabilities = (known after apply)
      + create_time             = (known after apply)
      + deletion_protection     = true
      + display_name            = "svc2"
      + folder_id               = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + management_project      = (known after apply)
      + name                    = (known after apply)
      + parent                  = "folders/1087303600957"
    }

  # module.dev-single-prjs["svc2"].google_folder.env_folders["dev"] will be created
  + resource "google_folder" "env_folders" {
      + configured_capabilities = (known after apply)
      + create_time             = (known after apply)
      + deletion_protection     = true
      + display_name            = "dev"
      + folder_id               = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + management_project      = (known after apply)
      + name                    = (known after apply)
      + parent                  = (known after apply)
    }

  # module.dev-single-prjs["svc2"].google_folder.env_folders["prod"] will be created
  + resource "google_folder" "env_folders" {
      + configured_capabilities = (known after apply)
      + create_time             = (known after apply)
      + deletion_protection     = true
      + display_name            = "prod"
      + folder_id               = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + management_project      = (known after apply)
      + name                    = (known after apply)
      + parent                  = (known after apply)
    }

  # module.dev-single-prjs["svc2"].google_folder.env_folders["shr"] will be created
  + resource "google_folder" "env_folders" {
      + configured_capabilities = (known after apply)
      + create_time             = (known after apply)
      + deletion_protection     = true
      + display_name            = "shr"
      + folder_id               = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + management_project      = (known after apply)
      + name                    = (known after apply)
      + parent                  = (known after apply)
    }

  # module.dev-single-prjs["svc2"].google_network_connectivity_spoke.single-prj-spoke will be created
  + resource "google_network_connectivity_spoke" "single-prj-spoke" {
      + create_time      = (known after apply)
      + description      = "NCC Spoke - Single Prj - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + group            = "projects/chspoc-dev-core/locations/global/hubs/ncc-dev-hub/groups/center"
      + hub              = "projects/chspoc-dev-core/locations/global/hubs/ncc-dev-hub"
      + id               = (known after apply)
      + location         = "global"
      + name             = "ncc-chspoc-dev-single-svc2-spoke"
      + project          = "chspoc-dev-single-svc2"
      + reasons          = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + unique_id        = (known after apply)
      + update_time      = (known after apply)

      + linked_vpc_network {
          + uri = (known after apply)
        }
    }

  # module.dev-single-prjs["svc2"].google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "019AF3-3082AF-842582"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "chspoc-dev-single-svc2"
      + number              = (known after apply)
      + project_id          = "chspoc-dev-single-svc2"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.dev-single-prjs["svc2"].google_project_iam_member.service_agents["compute-system"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + role    = "roles/compute.serviceAgent"
    }

  # module.dev-single-prjs["svc2"].google_project_iam_member.service_agents["container-engine-robot"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + role    = "roles/container.serviceAgent"
    }

  # module.dev-single-prjs["svc2"].google_project_iam_member.service_agents["dns"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + role    = "roles/dns.serviceAgent"
    }

  # module.dev-single-prjs["svc2"].google_project_iam_member.service_agents["gkenode"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + role    = "roles/container.defaultNodeServiceAgent"
    }

  # module.dev-single-prjs["svc2"].google_project_iam_member.service_agents["monitoring-notification"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + role    = "roles/monitoring.notificationServiceAgent"
    }

  # module.dev-single-prjs["svc2"].google_project_iam_member.service_agents["networkmanagement"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + role    = "roles/networkmanagement.serviceAgent"
    }

  # module.dev-single-prjs["svc2"].google_project_iam_member.service_agents["service-networking"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + role    = "roles/servicenetworking.serviceAgent"
    }

  # module.dev-single-prjs["svc2"].google_project_iam_member.service_agents["vpcaccess"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + role    = "roles/vpcaccess.serviceAgent"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "compute.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "container.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["dns.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "dns.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["iap.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "iap.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "logging.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "monitoring.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "networkmanagement.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["networksecurity.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "networksecurity.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service.project_services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-single-svc2"
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service_identity.default["container.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + service = "container.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service_identity.default["dns.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + service = "dns.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service_identity.default["iap.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + service = "iap.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service_identity.default["monitoring.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + service = "monitoring.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service_identity.default["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + service = "networkmanagement.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service_identity.default["networksecurity.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + service = "networksecurity.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service_identity.default["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + service = "servicenetworking.googleapis.com"
    }

  # module.dev-single-prjs["svc2"].google_project_service_identity.default["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-single-svc2"
      + service = "vpcaccess.googleapis.com"
    }

  # module.prod-net-firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-inspect-app-svc"] will be updated in-place
  ~ resource "google_compute_firewall_policy_rule" "hierarchical" {
        id                      = "locations/global/firewallPolicies/2540520614/rules/4201"
      ~ security_profile_group  = "//networksecurity.googleapis.com/organizations/872410903863/locations/global/securityProfileGroups/secprof-nsp-threatprevention-p-group" -> "organizations/872410903863/locations/global/securityProfileGroups/secprof-nsp-threatprevention-p-group"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev-single-prjs["app2"].module.vpc.google_compute_network.network[0] will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + description                               = "Terraform-managed."
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "vpc-dev-app2"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "chspoc-dev-single-app2"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.dev-single-prjs["app2"].module.vpc.google_compute_route.gateway["directpath-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "34.126.0.0/18"
      + id                         = (known after apply)
      + name                       = "vpc-dev-app2-directpath-googleapis"
      + network                    = "vpc-dev-app2"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-dev-single-app2"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.dev-single-prjs["app2"].module.vpc.google_compute_route.gateway["private-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.8/30"
      + id                         = (known after apply)
      + name                       = "vpc-dev-app2-private-googleapis"
      + network                    = "vpc-dev-app2"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-dev-single-app2"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.dev-single-prjs["app2"].module.vpc.google_compute_route.gateway["restricted-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.4/30"
      + id                         = (known after apply)
      + name                       = "vpc-dev-app2-restricted-googleapis"
      + network                    = "vpc-dev-app2"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-dev-single-app2"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.dev-single-prjs["app2"].module.vpc.google_compute_subnetwork.subnetwork["us-central1/sn-devapp2-usc1-a"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + allow_subnet_cidr_routes_overlap = (known after apply)
      + creation_timestamp               = (known after apply)
      + description                      = "Terraform-managed."
      + enable_flow_logs                 = (known after apply)
      + external_ipv6_prefix             = (known after apply)
      + fingerprint                      = (known after apply)
      + gateway_address                  = (known after apply)
      + id                               = (known after apply)
      + internal_ipv6_prefix             = (known after apply)
      + ip_cidr_range                    = "10.3.41.0/24"
      + ipv6_cidr_range                  = (known after apply)
      + ipv6_gce_endpoint                = (known after apply)
      + name                             = "sn-devapp2-usc1-a"
      + network                          = "vpc-dev-app2"
      + private_ip_google_access         = true
      + private_ipv6_google_access       = (known after apply)
      + project                          = "chspoc-dev-single-app2"
      + purpose                          = (known after apply)
      + region                           = "us-central1"
      + self_link                        = (known after apply)
      + send_secondary_ip_range_if_empty = true
      + stack_type                       = (known after apply)
      + state                            = (known after apply)
      + subnetwork_id                    = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.dev-single-prjs["svc2"].module.vpc.google_compute_network.network[0] will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + description                               = "Terraform-managed."
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "vpc-dev-svc2"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "chspoc-dev-single-svc2"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.dev-single-prjs["svc2"].module.vpc.google_compute_route.gateway["directpath-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "34.126.0.0/18"
      + id                         = (known after apply)
      + name                       = "vpc-dev-svc2-directpath-googleapis"
      + network                    = "vpc-dev-svc2"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-dev-single-svc2"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.dev-single-prjs["svc2"].module.vpc.google_compute_route.gateway["private-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.8/30"
      + id                         = (known after apply)
      + name                       = "vpc-dev-svc2-private-googleapis"
      + network                    = "vpc-dev-svc2"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-dev-single-svc2"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.dev-single-prjs["svc2"].module.vpc.google_compute_route.gateway["restricted-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.4/30"
      + id                         = (known after apply)
      + name                       = "vpc-dev-svc2-restricted-googleapis"
      + network                    = "vpc-dev-svc2"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-dev-single-svc2"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.dev-single-prjs["svc2"].module.vpc.google_compute_subnetwork.subnetwork["us-central1/sn-devsvc2-usc1-a"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + allow_subnet_cidr_routes_overlap = (known after apply)
      + creation_timestamp               = (known after apply)
      + description                      = "Terraform-managed."
      + enable_flow_logs                 = (known after apply)
      + external_ipv6_prefix             = (known after apply)
      + fingerprint                      = (known after apply)
      + gateway_address                  = (known after apply)
      + id                               = (known after apply)
      + internal_ipv6_prefix             = (known after apply)
      + ip_cidr_range                    = "10.3.51.0/24"
      + ipv6_cidr_range                  = (known after apply)
      + ipv6_gce_endpoint                = (known after apply)
      + name                             = "sn-devsvc2-usc1-a"
      + network                          = "vpc-dev-svc2"
      + private_ip_google_access         = true
      + private_ipv6_google_access       = (known after apply)
      + project                          = "chspoc-dev-single-svc2"
      + purpose                          = (known after apply)
      + region                           = "us-central1"
      + self_link                        = (known after apply)
      + send_secondary_ip_range_if_empty = true
      + stack_type                       = (known after apply)
      + state                            = (known after apply)
      + subnetwork_id                    = (known after apply)

      + secondary_ip_range (known after apply)
    }

Plan: 74 to add, 2 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "root_folder_id" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "service_accounts" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `skipped`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*